red_church={'大推':['小推','中推','教堂','红地毯'],'红地毯左':['中推','小推','教堂','墓地'],'教堂内':['木屋','小门废墟','墓地废墟','大推'],'墓地地窖点':['大推','教堂','木屋','墓地废墟'],'墓地靠教堂':['小门废墟','木屋','小推','大推'],'墓地椅子旁':['小门废墟','墓地废墟','教堂','大门']}

moon_river={'鬼屋':['双滑梯','坏木马','三站台','好木马'],'鬼屋废墟':['鬼屋桥','月亮河','坏木马','三连废墟'],'鬼屋桥上':['鬼屋废墟','三站台','坏木马','二站台'],'鬼屋桥左':['马戏团','人皇桥','鬼屋','三连废墟'],'坏木马':['马戏团','双滑梯','鬼屋桥','鬼屋'],'马戏团':['终点站','好木马','鬼屋','人皇桥'],'三连废墟':['鬼屋','好木马','人皇桥','双滑梯']}

village={'大船':['海边废墟','厕所','小船','中场'],'大门两板':['船头','厕所','小船','双十一'],'海边':['木屋','玉米地','小船','大船'],'木屋风车':['双十一','中场','大船','船尾'],'双十一':['木屋废墟','玉米地','中场','大船'],'小船后两板':['玉米地','厕所','中场','大门废墟'],'玉米地':['双十一','中场','大门废墟','大船']}

military_factory={'厂房左侧':['木屋','木屋','大门','小门'],'大门废墟':['木屋','木屋','中场','厂房'],'木屋窗口':['厂房','中场','大门','木屋'],'木屋右侧':['木屋','中场','小门','厂房'],'小门':['木屋','中场','厂房','厂房','备注：均匀分布中场反弧形'],'小门废墟':['小门','中场','厂房','厂房','备注：厂房外附近分布同，均匀分布正弧形']}

hospital={'女神像废墟':['无敌废墟','无敌废墟','医院','三板'],'医院正门二楼':['女神像','无敌废墟','木屋','小树林'],'正门废墟':['木屋','小门','鸟笼','医院'],'木屋废墟':['女神像','医院','医院','正门废墟'],'无敌废墟':['木屋','木屋','医院','医院'],'女神像':['医院','三板','小树林','木屋']}

town={'大门': ['一版一窗', '红蝶楼', '四站房', '三站'], '红蝶桥': ['大门废墟', '三板废墟', '四站房', '红蝶楼'], '假门': ['居酒屋', '人皇机', '红蝶楼', '墓地'], '假门废墟': ['人皇机', '湖边废墟', ' 湖边两板一窗', '三站'], '角落楼': ['四站房', '假门房', '红蝶楼', '饰伞屋'], '墓地入口': ['假门房', '湖边废墟', '人皇机', '红蝶楼'], '小门': ['假门房', '三板废墟', '二站', '红蝶桥']}

chinese_street={'裁缝铺': ['花店', '御景轩', '剧场', '雨伞门'], '古树剧场': ['御景轩', '洗浴', '醉芳庭', '酒楼'], '御景轩': ['裁缝铺', '花店', '醉芳庭', '烧饼铺'], '杂货店': ['关公像', '狮子楼', '酒楼', '一窗一板'], '早茶店': ['狮子楼', '御景轩', '古树',"醉芳庭"]}

rio_memory={'大房': ['中场', '两板一窗', '两车', '雪人'], '大房窗口左': ['月亮门', '中场', '集装箱', '集装箱'], '大房角落': ['月亮门', '油罐', '中场', '南门'], '集装箱': ['木屋', '圣诞树', '南门', '大门'], '木屋窗口': ['月亮门废墟', '油罐', '大房', '两板一窗'], '木屋入口': ['月亮门废墟', '月亮门', '楼梯', '两板一窗'], '圣诞门': ['木屋', '中场', '两板一窗', '大房'], '油罐附近': ['圣诞树', '中场', '大房', '大房角落'], '月亮门废墟': ['木屋', '中场', '楼梯', '两车']}

ysf={
    "military_factory":{
        '厂房左侧':"0-24", 
        '大门废墟':"1-50", 
        '木屋窗口':"4-29", 
        '木屋右侧':"3-9", 
        '小门':"5-49", 
        '小门废墟':"7-10"

},
    "moon_river":{
        '鬼屋':"3-2", 
        '鬼屋废墟':"1-46",
        '鬼屋桥上':"5-46", 
        '鬼屋桥左':"7-2", 
        '坏木马':"4-20", 
        '马戏团':"8-17", 
        '三连废墟':"0-26"
    },
    "red_church":{
        '大推':"5-59", 
        '红地毯左':"4-34", 
        '教堂内':"7-15", 
        '墓地地窖点':"1-45", 
        '墓地靠教堂':"3-3", 
        '墓地椅子旁':"0-28"
    },
    "village":{
        '大船':"2-5", 
        '大门两板':"0-42", 
        '海边':"3-27", 
        '木屋风车':"8-39", 
        '双十一':"4-43", 
        '小船后两板':"6-0", 
        '玉米地':"7-25"
    },
    "hospital":{
        '女神像废墟':"7-16", 
        '医院正门二楼':"0-28", 
        '正门废墟':"1-50", 
        '木屋废墟':"3-10", 
        '无敌废墟':"4-29", 
        '女神像':"5-54"
    }
    }

affix={


}

