red_church={'大推':['小推','中推','教堂','红地毯'],'红地毯左':['中推','小推','教堂','墓地'],'教堂内':['木屋','小门废墟','墓地废墟','大推'],'墓地地窖点':['大推','教堂','木屋','墓地废墟'],'墓地靠教堂':['小门废墟','木屋','小推','大推'],'墓地椅子旁':['小门废墟','墓地废墟','教堂','大门']}

moon_river={'鬼屋':['双滑梯','坏木马','三站台','好木马'],'鬼屋废墟':['鬼屋桥','月亮河','坏木马','三连废墟'],'鬼屋桥上':['鬼屋废墟','三站台','坏木马','二站台'],'鬼屋桥左':['马戏团','人皇桥','鬼屋','三连废墟'],'坏木马':['马戏团','双滑梯','鬼屋桥','鬼屋','马戏团',''],'马戏团':['终点站','好木马','鬼屋','人皇桥'],'三连废墟':['鬼屋','好木马','人皇桥','双滑梯']}

village={'大船':['海边废墟','厕所','小船','中场'],'大门两板':['船头','厕所','小船','双十一'],'海边废墟':['木屋','玉米地','小船','大船'],'木屋风车':['双十一','中场','大船','船尾'],'双十一':['木屋废墟','玉米地','中场','大船'],'小船后两板':['玉米地','厕所','中场','大门废墟'],'玉米地':['双十一','中场','大门废墟','大船']}

military_factory={'厂房左侧':['木屋','木屋','大门','小门'],'大门废墟':['木屋','木屋','中场','厂房'],'木屋窗口':['厂房','中场','大门','木屋'],'木屋右侧':['木屋','中场','小门','厂房'],'小门':['木屋','中场','厂房','厂房','备注：均匀分布中场反弧形'],'小门废墟':['小门','中场','厂房','厂房','备注：厂房外附近分布同，均匀分布正弧形']}

hospital={'女神像废墟':['无敌废墟','无敌废墟','医院','三板'],'医院正门口二楼':['女神像','无敌废墟','木屋','小树林'],'正门废墟':['木屋','小门','鸟笼','医院'],'木屋废墟':['女神像','医院','医院','正门废墟'],'无敌废墟':['木屋','木屋','医院','医院'],'女神像':['医院','三板','小树林','木屋']}

